/*

Задача 1.

Написать функцию с одним целочисленным параметром n, которая проверяет,
 является ли число совершенным (число называется совершенным, если оно
  равно сумме всех своих делителей, кроме себя самого)

Задача 2. 

Написать рекурсивную функцию с одним целочисленным параметром n, 
вычисляющую сумму цифр в десятичной записи числа

Задача 3. 

Написать функцию, которая упорядочит по неубыванию
 элементы целочисленного массива А из n элементов
 (А и n  - параметры функции). Использовать сортировку
 выбором (select sort), в которой максимальный элемент 
 меняется местами с последним в массиве.

Задача 4.

Продемонстрировать работу функции из задачи 3 на массивах: 

 - упорядоченном по возрастанию

- элементы в обратном порядке

- первая половина массива возрастает, вторая - убывает

- элементы в произвольном порядке, отличном от рассмотренных

Для каждого из вариантов посчитать количество 
выполненных операций сравнения элементов массива. 

Задача 5.

Написать функцию, циклически сдвигающую 
элементы массива вправо на 2 элемента.
 Параметрами функции является массив
 и количество элементов в нем. Массива А из 5 
 элементов 1 2 3 4 5 после работы функции 
 должен быть превращен в массив 4 5 1 2 3

*/